index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Methods: Python programming for economists</title>
<meta name="author" content="Jan Boone" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Methods: Python programming for economists</h1>
<p>
This website contains the material for the MSc course Methods: Python programming for economists.
</p>

<p>
<b><b>This website is under construction for 2025/2026</b></b>
</p>

<p>
This year the course is taught by:
</p>
<ul class="org-ul">
<li>Jan Boone</li>
<li>Mery Ferrando</li>
<li>Joyce Ladenstein</li>
</ul>

<hr />
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#screencasts">Screencasts</a></li>
<li><a href="#org2068764">Organisation of the course</a>
<ul>
<li><a href="#orgcdc055a">Career Development part of the course</a></li>
<li><a href="#orgdcb32f6">For the python part we will use the following format:</a></li>
<li><a href="#lecture_schedule">Lecture schedule</a></li>
<li><a href="#orgd6d8297">First Lecture</a></li>
<li><a href="#org587aa4b">Datacamp</a></li>
<li><a href="#Deadlines">Deadlines</a></li>
<li><a href="#org5f9ff28">Questions</a></li>
</ul>
</li>
<li><a href="#orge5356c4">Assignments</a>
<ul>
<li><a href="#orgdb233ae">Submitting assignments</a></li>
<li><a href="#final_assignment">Final Assignment</a></li>
<li><a href="#orgf387365">what we are looking for</a></li>
<li><a href="#org26f60ab">resit of final assignment</a></li>
</ul>
</li>
<li><a href="#org3831b71">Python as programming language</a>
<ul>
<li><a href="#org49ea485">Jupyter notebooks</a></li>
</ul>
</li>
</ul>
</div>
</div>

<hr />
<div id="outline-container-screencasts" class="outline-2">
<h2 id="screencasts">Screencasts</h2>
<div class="outline-text-2" id="text-screencasts">
<p>
For this course a series of screencasts is available. The screencasts can be found on this <a href="./pagescreencasts.html">webpage.</a>
</p>
</div>
</div>
<div id="outline-container-org2068764" class="outline-2">
<h2 id="org2068764">Organisation of the course</h2>
<div class="outline-text-2" id="text-org2068764">
<p>
The course consists of a Career Development part and a python programming part. We discuss both briefly in this section.
</p>
</div>
<div id="outline-container-orgcdc055a" class="outline-3">
<h3 id="orgcdc055a">Career Development part of the course</h3>
<div class="outline-text-3" id="text-orgcdc055a">
<p>
Career development activities (workshops and career events) are part of the course ‘Methods: Python Programming’. The goal of this career development part of the course is to help students from the Master Economics transition into their careers after graduation. The focus is on personal growth and development and provides practical tools to be well prepared for the job application process.
</p>

<p>
In both semester 1 and semester 2, workshop(s) will be offered by Student Career Services. To pass the course ‘Methods: Python Programming’, you must participate in at least 1 workshop of your choice and at least 1 career event. You will receive a partial grade once you have completed the Python programming part of the course. At the end of the academic year, you will be assessed whether you have met the set criteria of the career development part of the course through a pass or fail. Only with a positive grade for the Python programming part of the course and a pass for the career development part of the course you have passed the course ‘Methods: Python Programming’.
</p>

<p>
For more information and for an overview of workshops and career events offered throughout the year check the <a href="https://tilburguniversity.instructure.com/courses/17415/modules">‘Career Development for MSc Economics’ Canvas page</a> and <a href="img/Syllabus_Career_Development_2025_2026.pdf">this file.</a>
</p>
</div>
</div>
<div id="outline-container-orgdcb32f6" class="outline-3">
<h3 id="orgdcb32f6">For the python part we will use the following format:</h3>
<div class="outline-text-3" id="text-orgdcb32f6">
<p>
Since we have recorded screencasts, we will not repeat these during the lectures. The lectures are meant for interaction (only).
</p>

<ul class="org-ul">
<li>in the python lectures we focus on answering your questions;</li>
<li>in order to prepare these answers, it is useful if you create an issue via <a href="https://github.com/janboone/Python-programming-for-economists/issues">this link</a>;
<ul class="org-ul">
<li>using the link, create an "issue" where you explain what your question is: what did you try and why did it not work?
<ul class="org-ul">
<li>hence not a something like "I do not know the answer to: <b>Question</b> Calculate the total welfare that this planner can achieve. Denote this value <code>max_welfare</code>."</li>
<li>but "I tried to calculate total welfare in the following way &#x2026; but then I get the following error &#x2026;"</li>
<li>describing your question like this, helps you better understand what your problem is</li>
<li>and it helps us to answer the question in class.</li>
</ul></li>
</ul></li>
<li>for us to be able to prepare these answers, submit the issue on the Friday before the week in which we discuss the topic
<ul class="org-ul">
<li>hence, finish the sections in the week before they are discussed in class</li>
<li>if you can solve everything yourself, there is no need to attend the lecture (but you are, of course, welcome to do so)</li>
<li>this is one of the advantages of programming: you can see for yourself whether it works or not.</li>
</ul></li>
<li>alternatively, you can ask questions to the <a href="https://programmingforeconomists.tilburgai.nl/">chatbot</a>
<ul class="org-ul">
<li>note that this is still experimental (no rights can be derived etc. etc.)</li>
<li>give us your feedback to improve the chatbot</li>
</ul></li>
</ul>

<p>
A suggested workflow to learn programming efficiently is:
</p>
<ul class="org-ul">
<li>follow the Datacamp courses and make notes of what you learn at Datacamp in a notebook on the jupyterlab server
<ul class="org-ul">
<li>in this way it is easy to refer back to useful code snippets that you see on Datacamp</li>
</ul></li>
<li>go through the jupyter notebook for the lecture and try to answer the questions</li>
<li>if you get stuck with a problem, watch the corresponding screencast for this part. It gives hints and ways to solve the questions in the notebook</li>
<li>if you still cannot figure it out, ask the chatbot or create an issue on github to ask us</li>
<li>we will answer your questions in class</li>
</ul>

<p>
In September there is a lecture on gender economics. In the lecture Mery will discuss some papers on this topic. There is a notebook where the models discussed are simulated in Python. This notebook is then discussed in a following lecture. The notebook will teach you something about gender economics and Python. At the same time, it shows you what we expect you to do in the final assignment for this course: take an existing theory paper and solve the model in Python and simulate outcomes of the model.
</p>

<p>
<b>Remark:</b> We have been teaching this course for a couple of years now. Every year there are a number of students who attend the lectures without preparing anything and watch the screencasts without trying to program themselves. We live in a free country and you choose how to spend your time. However, we do feel the need to warn you that this strategy does not work well. You actually end up spending far more time on finishing the course than when you follow the planning we suggest below. The reason is as follows: learning a programming language is frustrating. You learn by making mistakes and then trying to figure out what goes wrong. When you make these mistakes during the semester, you are well covered: we are there to help you. When you make these mistakes for the first time when trying to finish your assignment before the deadline, you are in trouble. We will try to help you but not within an hour, or within a day. And because you need to finish before the deadline, you have to figure everything out by yourself under time pressure. Not a pleasant experience and one you can easily avoid. But the choice is yours.
</p>
</div>
</div>
