index.org
** Lecture schedule
   :PROPERTIES:
   :CUSTOM_ID:       lecture_schedule
   :END:


|       date |        time | staff | room     | topic                                                          | datacamp             |
|------------+-------------+-------+----------+----------------------------------------------------------------+----------------------|
| 2025-09-04 | 10:45-12:30 | Jan   | MKZ 111  | Intro python, markdown, github, jupyterlab, lists, functions   |                      |
| 2025-09-11 | 10:45-12:30 | Joyce | CZ 112   | Intro Career Development                                       | Intro (1-4)          |
| 2025-09-18 | 10:45-12:30 | Jan   | CZ 112   | Matplotlib, dictionaries, numpy arrays, pandas                 | Intermediate (1,2)   |
| 2025-09-25 | 10:45-12:30 | Jan   | AZ 201   | Pandas: dataframe, groupby, selection, if statements, Booleans | Intermediate (3,4,5) |
| 2025-10-09 | 10:45-12:30 | Joyce | Cube 21  | Workshop 'stress management' (part 1)                          | pandas (1,2)         |
| 2025-10-15 | 10:45-12:30 | Joyce | CZ 9     | Career Perspectives with alumni                                | pandas (3,4)         |
| 2025-10-16 | 10:45-12:30 | Mery  | CZ 114   | Gender Economics                                               |                      |
| 2025-10-23 | 10:45-12:30 | Joyce | Cube 15  | Workshop ‘finding purpose’ (part 1)                            |                      |
| 2025-10-30 | 10:45-12:30 | Joyce | Cube 213 | Workshop 'stress management' (part 2)                          |                      |
| 2025-11-06 | 10:45-12:30 | Jan   | CZ 9     | The market and asymmetric information                          |                      |
| 2025-11-13 | 10:45-12:30 | Joyce | Cube 21  | Workshop ‘finding purpose’ (part 2)                            |                      |
| 2025-11-20 | 10:45-12:30 | Jan   | CZ 9     | Financial crisis, Empirical research                           |                      |
| 2025-11-27 | 10:45-12:30 | Jan   | CZ 9     | Notebook gender economics and Q&A                              |                      |
| 2025-12-04 | 10:45-12:30 | Jan   | CZ 9     | Reserve                                                        |                      |
| 2026-01-05 |             |       |          | deadline final assignment                                      |                      |
| 2026-05-11 |             |       |          | deadline resit                                                 |                      |

   
If you have programmed with python before, there is no need to attend the introduction to python lectures. In this case, attend the first lecture, the lectures by Joyce and Mery and then join the python lectures again when we start with "The market and asymmetric information".

** First Lecture

[[file:./Introduction_Lecture.org::#introduction][Introduction Lecture]]

*** Initial Assignment
    :PROPERTIES:
    :CUSTOM_ID:       initial_assignment
    :END:

Do the following three steps:
+ create a github account on [[https://github.com/][github]] (you need this account to submit your final assignment)
  + we advise you to do this before **Thursday September 25, 2025**
+ go to
  + [[https://jupyterlab.uvt.nl/][jupyter lab]]
    + IT suggests that you use the Firefox browser to access jupyter lab
    + sometimes it helps to access jupyter lab with an incognito/private window
    + or --if all else fails-- you can use [[https://colab.research.google.com/][google's colab]]
+ create a new python notebook and type the following code in the first cell:
#+BEGIN_SRC shell
%%bash

git clone https://github.com/janboone/Python-programming-for-economists.git
#+END_SRC
+ then press the Shift key and Enter key at the same time
+ this creates a folder on the server `Python-programming-for-economists` that contains the material for the course.
+ Note: you can only run this command once. If you run it again, you get an error since the folder already exists.
+ If you want to see the final assignment in jupyter lab, you can also type:
#+BEGIN_SRC shell
%%bash

git clone https://github.com/janboone/python_assignments
#+END_SRC

- you can view the final assignment in this repository: https://github.com/janboone/python_assignments
- instructions for the assignment can be found below.

** Datacamp

You can get access to Datacamp via the [[https://www.tilburguniversity.edu/students/skills/programming][university website]].

From Datacamp, do the following courses:

+ Intro: [[https://www.datacamp.com/courses/intro-to-python-for-data-science]]
+ Intermediate: [[https://www.datacamp.com/courses/intermediate-python-for-data-science]]
+ Pandas: https://learn.datacamp.com/courses/data-manipulation-with-pandas

These courses teach you the basic Python syntax. In the lectures and notebook for the course, we use parts of Python more specific to economics; e.g. commands to solve equations, equilibria etc. These parts of the course complement each other. It is not the case that all Python that we use, you will first see in Datacamp.

It is up to you how to combine the Datacamp courses with the [[file:./pagescreencasts.org][Screencasts]]. We suggest to finish the Datacamp Intro course first. As there is no economics on Datacamp, some students prefer to start with the screencasts after the Intro. Others prefer to finish more Datacamp courses before they start on the screencasts. Just see what works for you. But make sure you follow the planning above, otherwise you might get lost if you are too far behind and the lectures will not be as useful to you.

Most students like Datacamp to get used to the python syntax. A minority of students really dislike Datacamp. If you do not like it either, you can also read [[https://greenteapress.com/wp/think-python-3rd-edition/][Think Python]]. You can buy the book or read the free online version. The jupyter notebooks can be found on [[https://github.com/AllenDowney/ThinkPython/tree/v3][github]]. You can clone this repository and work with the notebooks. You can also find some wonderful presentations on Youtube by the author Allen Downey.

** Deadlines
   :PROPERTIES:
   :CUSTOM_ID: Deadlines
   :END:

- The deadline for the *final python assignment* is: Monday January 5th, 2026. 
- The resit deadline for the python assignment is: Monday May 11th, 2026. Let us know by email that you have submitted your assignment for the resit.
- Your grade is determined by:
  - a "pass" on the Career Services assignments;
  - final assignment.

Follow the instructions below and on Canvas explaining how to submit an assignment on github and fill in the google form etc.

Also note the rules for the resit of the final assignment in case you submitted an assignment for the first exam opportunity (you cannot discuss/program the same paper twice for your assignment).



** Questions

 If you have questions/comments about this course, go to the [[https://github.com/janboone/Python-programming-for-economists/issues][issues page]]
 open a new issue (with the green "New issue" button) and type your
 question. Use a title that is informative (e.g. not "question", but
 "question about the final assignment"). Go to the next box ("Leave a comment")
 and type your question. Then click on "Submit new issue". We will
 answer your question as quickly as possible.

 The advantages of the issue page include:

 + if you have a question, other students may have it as well; in this
   way we answer the questions in a way that everyone can see it. Also
   before asking the question, you may want to check whether it was
   asked/answered before on the issue page
 + we answer your question more quickly than when you email us
 + you increase your knowledge of github!

 Only when you need to include privately sensitive information ("my parrot
 has passed away"), you can send an email.

 In order to post issues, you need to create a github account (which
 you need anyway to follow this course).

 Note that if your question is related to another issue, you can react
 to the earlier issue and leave a comment in that "conversation".

* Assignments

For this course there is one final assignment. You can find it in this repository: https://github.com/janboone/python_assignments.

Note that you can do the assignment alone or with at max. one other student (i.e. max group size is 2).

