index.html
<div id="outline-container-lecture_schedule" class="outline-3">
<h3 id="lecture_schedule">Lecture schedule</h3>
<div class="outline-text-3" id="text-lecture_schedule">
<p>
<b>To be added</b>
</p>
</div>
</div>
<div id="outline-container-orgd6d8297" class="outline-3">
<h3 id="orgd6d8297">First Lecture</h3>
<div class="outline-text-3" id="text-orgd6d8297">
<p>
<a href="./Introduction_Lecture.html#introduction">Introduction Lecture</a>
</p>
</div>
<div id="outline-container-initial_assignment" class="outline-4">
<h4 id="initial_assignment">Initial Assignment</h4>
<div class="outline-text-4" id="text-initial_assignment">
<p>
Do the following three steps:
</p>
<ul class="org-ul">
<li>create a github account on <a href="https://github.com/">github</a> (you need this account to submit your final assignment)
<ul class="org-ul">
<li>we advise you to do this before <b><b>Thursday September 25, 2025</b></b></li>
</ul></li>
<li>go to
<ul class="org-ul">
<li><a href="https://jupyterlab.uvt.nl/">jupyter lab</a>
<ul class="org-ul">
<li>IT suggests that you use the Firefox browser to access jupyter lab</li>
<li>sometimes it helps to access jupyter lab with an incognito/private window</li>
<li>or &#x2013;if all else fails&#x2013; you can use <a href="https://colab.research.google.com/">google's colab</a></li>
</ul></li>
</ul></li>
<li>create a new python notebook and type the following code in the first cell:</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">%%bash

git clone https://github.com/janboone/Python-programming-for-economists.git
</pre>
</div>
<ul class="org-ul">
<li>then press the Shift key and Enter key at the same time</li>
<li>this creates a folder on the server `Python-programming-for-economists` that contains the material for the course.</li>
<li>Note: you can only run this command once. If you run it again, you get an error since the folder already exists.</li>
<li>If you want to see the final assignment in jupyter lab, you can also type:</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">%%bash

git clone https://github.com/janboone/python_assignments
</pre>
</div>

<ul class="org-ul">
<li>you can view the final assignment in this repository: <a href="https://github.com/janboone/python_assignments">https://github.com/janboone/python_assignments</a></li>
<li>instructions for the assignment can be found below.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org587aa4b" class="outline-3">
<h3 id="org587aa4b">Datacamp</h3>
<div class="outline-text-3" id="text-org587aa4b">
<p>
You can get access to Datacamp via the <a href="https://www.tilburguniversity.edu/students/skills/programming">university website</a>.
</p>

<p>
From Datacamp, do the following courses:
</p>

<ul class="org-ul">
<li>Intro: <a href="https://www.datacamp.com/courses/intro-to-python-for-data-science">https://www.datacamp.com/courses/intro-to-python-for-data-science</a></li>
<li>Intermediate: <a href="https://www.datacamp.com/courses/intermediate-python-for-data-science">https://www.datacamp.com/courses/intermediate-python-for-data-science</a></li>
<li>Pandas: <a href="https://learn.datacamp.com/courses/data-manipulation-with-pandas">https://learn.datacamp.com/courses/data-manipulation-with-pandas</a></li>
</ul>

<p>
These courses teach you the basic Python syntax. In the lectures and notebook for the course, we use parts of Python more specific to economics; e.g. commands to solve equations, equilibria etc. These parts of the course complement each other. It is not the case that all Python that we use, you will first see in Datacamp.
</p>

<p>
It is up to you how to combine the Datacamp courses with the <a href="./pagescreencasts.html">Screencasts</a>. We suggest to finish the Datacamp Intro course first. As there is no economics on Datacamp, some students prefer to start with the screencasts after the Intro. Others prefer to finish more Datacamp courses before they start on the screencasts. Just see what works for you. But make sure you follow the planning above, otherwise you might get lost if you are too far behind and the lectures will not be as useful to you.
</p>

<p>
Most students like Datacamp to get used to the python syntax. A minority of students really dislike Datacamp. If you do not like it either, you can also read <a href="https://greenteapress.com/wp/think-python-3rd-edition/">Think Python</a>. You can buy the book or read the free online version. The jupyter notebooks can be found on <a href="https://github.com/AllenDowney/ThinkPython/tree/v3">github</a>. You can clone this repository and work with the notebooks. You can also find some wonderful presentations on Youtube by the author Allen Downey.
</p>
</div>
</div>
<div id="outline-container-Deadlines" class="outline-3">
<h3 id="Deadlines">Deadlines</h3>
<div class="outline-text-3" id="text-Deadlines">
<ul class="org-ul">
<li>The deadline for the <b>final python assignment</b> is: Monday January 5th, 2026.</li>
<li>The resit deadline for the python assignment is: Monday May 11th, 2026. Let us know by email that you have submitted your assignment for the resit.</li>
<li>Your grade is determined by:
<ul class="org-ul">
<li>a "pass" on the Career Services assignments;</li>
<li>final assignment.</li>
</ul></li>
</ul>

<p>
Follow the instructions below and on Canvas explaining how to submit an assignment on github and fill in the google form etc.
</p>

<p>
Also note the rules for the resit of the final assignment in case you submitted an assignment for the first exam opportunity (you cannot discuss/program the same paper twice for your assignment).
</p>
</div>
</div>
<div id="outline-container-org5f9ff28" class="outline-3">
<h3 id="org5f9ff28">Questions</h3>
<div class="outline-text-3" id="text-org5f9ff28">
<p>
If you have questions/comments about this course, go to the <a href="https://github.com/janboone/Python-programming-for-economists/issues">issues page</a>
open a new issue (with the green "New issue" button) and type your
question. Use a title that is informative (e.g. not "question", but
"question about the final assignment"). Go to the next box ("Leave a comment")
and type your question. Then click on "Submit new issue". We will
answer your question as quickly as possible.
</p>

<p>
The advantages of the issue page include:
</p>

<ul class="org-ul">
<li>if you have a question, other students may have it as well; in this
way we answer the questions in a way that everyone can see it. Also
before asking the question, you may want to check whether it was
asked/answered before on the issue page</li>
<li>we answer your question more quickly than when you email us</li>
<li>you increase your knowledge of github!</li>
</ul>

<p>
Only when you need to include privately sensitive information ("my parrot
has passed away"), you can send an email.
</p>

<p>
In order to post issues, you need to create a github account (which
you need anyway to follow this course).
</p>

<p>
Note that if your question is related to another issue, you can react
to the earlier issue and leave a comment in that "conversation".
</p>
</div>
</div>
</div>
<div id="outline-container-orge5356c4" class="outline-2">
<h2 id="orge5356c4">Assignments</h2>
<div class="outline-text-2" id="text-orge5356c4">
<p>
For this course there is one final assignment. You can find it in this repository: <a href="https://github.com/janboone/python_assignments">https://github.com/janboone/python_assignments</a>.
</p>

<p>
Note that you can do the assignment alone or with at max. one other student (i.e. max group size is 2).
</p>
</div>
