index.org
** Submitting assignments

The final assignment is submitted using github classroom:
- on Canvas we will give you the link to the github repos. with the assignment notebook;
- instructions on how to work with github classroom can be found [[file:./Manual_students.pdf][here]]
- to submit your assignment:
  + do not change the name of the assignment notebook
  + when you submit your final assignment, fill in the google form where the link to the form is on Canvas
  + push the assignment notebook to your team's github classroom repository


** TODO Instructions for submitting final assignment to be put on Canvas :noexport:
*** relevant links:

**** TODO each year renew classroom links for the new year
- [X] set deadline in github classroom
- [ ] add github classroom assignment with the template repos. for 2025/6:
  - https://forms.gle/4oaPJ2APQArAQrzx9
  - https://classroom.github.com/classrooms/16413080-tisem-python-for-economists/assignments/assignments-2025-2026
  - invite link: https://classroom.github.com/a/AJx5NX7k


**** TODO google form
- [ ] create google form for students to fill in once they finish assignment: https://forms.gle/4oaPJ2APQArAQrzx9 (this is the link for 2025/2026)
- [ ] in the google form adjust the format of the assignment address for the new year
- [ ] change link to the classroom assignment and google form below

- instructions are attached to website (no need to repeat on Canvas): [[file:~/Google Drive/repositories/github/websites/github_classroom_assignments/how_to_use_nbgrader_github_classroom/Manual_students.pdf]]
- show uploading assignment to github classroom during lecture

*** Canvas

**** TODO copy/paste on Canvas

Dear students,

The link for the python assignments (template) is: https://classroom.github.com/a/AJx5NX7k (this is the link for 2025/2026)

You can do the assignments on your own or with (at max.) one other student. You make all three assignments with the same team (either all 3 on your own or with the same fellow student).

When you use the link to the assignment, you will be asked for your team's name. Choose your favorite name!

When you finish your assignment:

1. download your assignment (jupyter notebook) from jupyter lab (or google colabs; or check where it is on your computer when using anaconda) to your computer (e.g. in the folder Downloads)

2. push it onto your assignment's github repository using github classroom web interface

3. fill in the following google form: https://forms.gle/4oaPJ2APQArAQrzx9 (note 1: you need to be logged in with your @tilburguniversity.edu account to access the form; note 2: you only need to fill in the google form once).

We need the information from the google form to link your assignment to your student number which is needed for the exam administration.

If you have questions about the assignment or the procedure described above, create an issue on the webpage at: https://github.com/janboone/Python-programming-for-economists/issues

Then you can see whether other students had the same question (which was already answered) or fellow-students can learn from your question. These issues can be read by anyone, so do not provide any privacy related information.

Good luck with the assignments,

Jan.


** Final Assignment
  :PROPERTIES:
  :CUSTOM_ID: final_assignment
  :END:


- for the deadlines of the final assignment, see [[Deadlines]] above

** what we are looking for

The idea of the final assignment is that you report your findings in a transparent way that can easily be verified/reproduced by others. The intended audience is your fellow students. They should be able to understand the code you write together with the explanations that you give for this code.

The following ingredients will be important when we evaluate your final assignment:

+ Start from a *theory* (i.e. not empirical) paper; e.g. one you have read for another course.
+ Briefly describe what the paper does and what the main results are.
+ Then formulate a clear and transparent *question* that cannot be immediately answered by the paper.
  + Extend the paper's model (a bit) using the fact that you will simulate the model and do not need to provide an analytical solution.
    + note: we do not expect a major extension of the model; just a small change and use simulations to show how results differ due to this adaptation of the model.
    + hint: choose a question/extension where you can show off your programming skills!
+ Briefly *motivate* why this question is interesting.
+ Give the *answer* that you find (as a preview).
+ Mention the main *assumptions* that you need to get this answer.
+ Use $\LaTeX$ to introduce and explain the model of the paper. Describe the main equations (using $\LaTeX$) of the model.
+ When you use information (e.g. a literature reference), create a link to this information. The reader then only needs to click to find the relevant information.
+ Describe your (small) extension of the model.
+ Explain how you move from the analytical equations of the paper to Python code.
+ Use some *optimization methods* (e.g. agents maximize utility or firms minimize costs).
+ Solve for an *equilibrium* using Python (using fixed points).
+ Simulate outcomes by using different values for parameters and save the outcomes of the simulations in a pandas dataframe.
+ Explain your code, the reader --think of your fellow students-- must be able to easily follow what you are doing.
+ Explain your code in Markdown blocks, not as comments in code blocks.
+ Present graphs of your simulation results using =matplotlib=.
+ Discuss what the figures show (e.g. $x$ is increasing in $y$) and explain the economic intuition for this relation (between $x$ and $y$).
+ Present a clear conclusion/answer to your question.
+ Finish with a brief *discussion* of your results.

Remark:
+ you can copy code from the web or an LLM; but
  + make sure that you explain the code that you use so that another student of the course understands it and can use it;
  + give the reference of the code that you copy
  + explain the economics of your results yourself; do not rely on the [[file:LLM.org][LLM]] only.


** resit of final assignment

The resit of the final assignment needs to start from a new paper compared to the one you handed in before. Simply adjusting your first submission based on our feedback will be not be enough.

Otherwise, follow the procedure above on how to submit the assignment and fill in the google form (if you have not done so before). Also send us an email that you submitted the assignment for the resit.


* Python as programming language

We use Python as programming language. A fair question is:
why Python? The non-scientific answer is: because we like it a lot.

You can also check the following links:
- https://www.datacamp.com/community/blog/python-scientific-computing-case
- https://github.com/jupyter/jupyter/wiki/A-gallery-of-interesting-Jupyter-Notebooks


Resources for python:

+ [[https://scipy-lectures.github.io/]]
+ [[http://www.physics.nyu.edu/pine/pymanual/html/pymanMaster.html]]
+ https://aeturrell.github.io/coding-for-economists/intro.html (introduction to python with economics in mind)
+ https://python.quantecon.org/intro.html (fairly advanced economics with python)
+ [[https://www.youtube.com/playlist?list=PLi01XoE8jYohWFPpC17Z-wWhPOSuh8Er-]] (video lectures on a number of python topics)

** Jupyter notebooks


*** Markdown

For the assignment it is useful to know a bit of markdown. You can
either google "markdown tutorial" or use one of the following websites:

+ [[http://daringfireball.net/projects/markdown/]]
+ [[https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet]]

