index.html
<div id="outline-container-orgdb233ae" class="outline-3">
<h3 id="orgdb233ae">Submitting assignments</h3>
<div class="outline-text-3" id="text-orgdb233ae">
<p>
The final assignment is submitted using github classroom:
</p>
<ul class="org-ul">
<li>on Canvas we will give you the link to the github repos. with the assignment notebook;</li>
<li>instructions on how to work with github classroom can be found <a href="./Manual_students.pdf">here</a></li>
<li>to submit your assignment:
<ul class="org-ul">
<li>do not change the name of the assignment notebook</li>
<li>when you submit your final assignment, fill in the google form where the link to the form is on Canvas</li>
<li>push the assignment notebook to your team's github classroom repository</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-final_assignment" class="outline-3">
<h3 id="final_assignment">Final Assignment</h3>
<div class="outline-text-3" id="text-final_assignment">
<ul class="org-ul">
<li>for the deadlines of the final assignment, see <a href="#Deadlines">Deadlines</a> above</li>
</ul>
</div>
</div>
<div id="outline-container-orgf387365" class="outline-3">
<h3 id="orgf387365">what we are looking for</h3>
<div class="outline-text-3" id="text-orgf387365">
<p>
The idea of the final assignment is that you report your findings in a transparent way that can easily be verified/reproduced by others. The intended audience is your fellow students. They should be able to understand the code you write together with the explanations that you give for this code.
</p>

<p>
The following ingredients will be important when we evaluate your final assignment:
</p>

<ul class="org-ul">
<li>Start from a <b>theory</b> (i.e. not empirical) paper; e.g. one you have read for another course.</li>
<li>Briefly describe what the paper does and what the main results are.</li>
<li>Then formulate a clear and transparent <b>question</b> that cannot be immediately answered by the paper.
<ul class="org-ul">
<li>Extend the paper's model (a bit) using the fact that you will simulate the model and do not need to provide an analytical solution.
<ul class="org-ul">
<li>note: we do not expect a major extension of the model; just a small change and use simulations to show how results differ due to this adaptation of the model.</li>
<li>hint: choose a question/extension where you can show off your programming skills!</li>
</ul></li>
</ul></li>
<li>Briefly <b>motivate</b> why this question is interesting.</li>
<li>Give the <b>answer</b> that you find (as a preview).</li>
<li>Mention the main <b>assumptions</b> that you need to get this answer.</li>
<li>Use \(\LaTeX\) to introduce and explain the model of the paper. Describe the main equations (using \(\LaTeX\)) of the model.</li>
<li>When you use information (e.g. a literature reference), create a link to this information. The reader then only needs to click to find the relevant information.</li>
<li>Describe your (small) extension of the model.</li>
<li>Explain how you move from the analytical equations of the paper to Python code.</li>
<li>Use some <b>optimization methods</b> (e.g. agents maximize utility or firms minimize costs).</li>
<li>Solve for an <b>equilibrium</b> using Python (using fixed points).</li>
<li>Simulate outcomes by using different values for parameters and save the outcomes of the simulations in a pandas dataframe.</li>
<li>Explain your code, the reader &#x2013;think of your fellow students&#x2013; must be able to easily follow what you are doing.</li>
<li>Explain your code in Markdown blocks, not as comments in code blocks.</li>
<li>Present graphs of your simulation results using <code>matplotlib</code>.</li>
<li>Discuss what the figures show (e.g. \(x\) is increasing in \(y\)) and explain the economic intuition for this relation (between \(x\) and \(y\)).</li>
<li>Present a clear conclusion/answer to your question.</li>
<li>Finish with a brief <b>discussion</b> of your results.</li>
</ul>

<p>
Remark:
</p>
<ul class="org-ul">
<li>you can copy code from the web or an LLM; but
<ul class="org-ul">
<li>make sure that you explain the code that you use so that another student of the course understands it and can use it;</li>
<li>give the reference of the code that you copy.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org26f60ab" class="outline-3">
<h3 id="org26f60ab">resit of final assignment</h3>
<div class="outline-text-3" id="text-org26f60ab">
<p>
The resit of the final assignment needs to start from a new paper compared to the one you handed in before. Simply adjusting your first submission based on our feedback will be not be enough.
</p>

<p>
Otherwise, follow the procedure above on how to submit the assignment and fill in the google form (if you have not done so before). Also send us an email that you submitted the assignment for the resit.
</p>
</div>
</div>
</div>
<div id="outline-container-org3831b71" class="outline-2">
<h2 id="org3831b71">Python as programming language</h2>
<div class="outline-text-2" id="text-org3831b71">
<p>
We use Python as programming language. A fair question is:
why Python? The non-scientific answer is: because we like it a lot.
</p>

<p>
You can also check the following links:
</p>
<ul class="org-ul">
<li><a href="https://www.datacamp.com/community/blog/python-scientific-computing-case">https://www.datacamp.com/community/blog/python-scientific-computing-case</a></li>
<li><a href="https://github.com/jupyter/jupyter/wiki/A-gallery-of-interesting-Jupyter-Notebooks">https://github.com/jupyter/jupyter/wiki/A-gallery-of-interesting-Jupyter-Notebooks</a></li>
</ul>


<p>
Resources for python:
</p>

<ul class="org-ul">
<li><a href="https://scipy-lectures.github.io/">https://scipy-lectures.github.io/</a></li>
<li><a href="http://www.physics.nyu.edu/pine/pymanual/html/pymanMaster.html">http://www.physics.nyu.edu/pine/pymanual/html/pymanMaster.html</a></li>
<li><a href="https://aeturrell.github.io/coding-for-economists/intro.html">https://aeturrell.github.io/coding-for-economists/intro.html</a> (introduction to python with economics in mind)</li>
<li><a href="https://python.quantecon.org/intro.html">https://python.quantecon.org/intro.html</a> (fairly advanced economics with python)</li>
<li><a href="https://www.youtube.com/playlist?list=PLi01XoE8jYohWFPpC17Z-wWhPOSuh8Er-">https://www.youtube.com/playlist?list=PLi01XoE8jYohWFPpC17Z-wWhPOSuh8Er-</a> (video lectures on a number of python topics)</li>
</ul>
</div>
<div id="outline-container-org49ea485" class="outline-3">
<h3 id="org49ea485">Jupyter notebooks</h3>
<div class="outline-text-3" id="text-org49ea485">
</div>
<div id="outline-container-org4b1b880" class="outline-4">
<h4 id="org4b1b880">Markdown</h4>
<div class="outline-text-4" id="text-org4b1b880">
<p>
For the assignment it is useful to know a bit of markdown. You can
either google "markdown tutorial" or use one of the following websites:
</p>

<ul class="org-ul">
<li><a href="http://daringfireball.net/projects/markdown/">http://daringfireball.net/projects/markdown/</a></li>
<li><a href="https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet">https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet</a></li>
</ul>
</div>
</div>
