index.org
*** $\LaTeX$

For the python assignment it is useful to familiarize yourself with
$\LaTeX$. Note that you do not need to type a whole document in $\LaTeX$ (so
don't worry about preambles etc.), you just need to know how to type
$x^2$, $\alpha,\beta$ or have math displayed like

\begin{equation}
a^2 + b^2 = c^2
\end{equation}

Google "latex tutorial" or go to pages like:

+ [[https://www.latex-tutorial.com/tutorials/amsmath/]]
+ [[http://www.andy-roberts.net/writing/latex/mathematics_1]]

and focus on typesetting.
