index.html
<div id="outline-container-org835d54e" class="outline-4">
<h4 id="org835d54e">\(\LaTeX\)</h4>
<div class="outline-text-4" id="text-org835d54e">
<p>
For the python assignment it is useful to familiarize yourself with
\(\LaTeX\). Note that you do not need to type a whole document in \(\LaTeX\) (so
don't worry about preambles etc.), you just need to know how to type
\(x^2\), \(\alpha,\beta\) or have math displayed like
</p>

\begin{equation}
a^2 + b^2 = c^2
\end{equation}

<p>
Google "latex tutorial" or go to pages like:
</p>

<ul class="org-ul">
<li><a href="https://www.latex-tutorial.com/tutorials/amsmath/">https://www.latex-tutorial.com/tutorials/amsmath/</a></li>
<li><a href="http://www.andy-roberts.net/writing/latex/mathematics_1">http://www.andy-roberts.net/writing/latex/mathematics_1</a></li>
</ul>

<p>
and focus on typesetting.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jan Boone</p>
</div>
</body>
</html>
